{
	"Número": 821,
	"Título":"OPERATION 21 DEFECT",
	"Descripción":"THE PULSES READ DURING A TOOL UNCLAMP OPERATION HAS BEEN INSUFICENTS.",
	"Preguntas":[
		{
			"Id":"1.0",
			"Texto":"1. The KEYENCE unit, is the one in charge of checking the pulses of the turbines to determine the status of the tool. What color does the KEYENCE screen have? Red or green?",
			"Imágenes":[
				"keyence_red",
				"keyence_green"
			],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Red.",
					"Camino":"1.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"Green.",
					"Camino":"2.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"1.1",
			"Texto":"1.1. The KEYENCE module is stopped. It is necessary to put it in RUN mode to read the pulses generated by the turbines. This can be done through the 'Ladder Builder' program or using the buttons on the front of it. Does the alarm dissapear?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, the alarm doesn't appear again.",
					"Camino":"",
					"Mensaje":"Yes. The KEYENCE module was in STOP mode."
				},
				{
					"Id":"B",
					"Texto":"No, it happened again. ",
					"Camino":"",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"2.0",
			"Texto":"2. Is the measurement / expulsion of the clamp correct?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"No, it is not correct.",
					"Camino":"2.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"Yes, it is right.",
					"Camino":"3.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"2.1",
			"Texto":"2.1. Check that the centre lock screw is tight, if not, adjust the unclamping distance (rotating the gripper) and tight the screw. Does the alarm dissapear?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, the alarm doesn't appear again.",
					"Camino":"",
					"Mensaje":"Yes, the tool gripper was not properly adjusted."
				},
				{
					"Id":"B",
					"Texto":"No, it happened again. ",
					"Camino":"3.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"3.0",
			"Texto":"3. Is the pressure of the hydraulic unit correct or is the loil evel low?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"No, it is not right.",
					"Camino":"3.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"Yes, it is right.",
					"Camino":"4.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"3.1",
			"Texto":"3.1. Adjust the pressure and/or refill the tank. Does the alarm dissapear?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, it disappears.",
					"Camino":"",
					"Mensaje":"Yes, the problem was not enough oil in the tank or a low pressure."
				},
				{
					"Id":"B",
					"Texto":"No, it does not disappear",
					"Camino":"4.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"4.0",
			"Texto":"4. The tool clamping piston when the tool is clamped, has an air pressure to lift the piston. If, when the tool is unclamped, this air pressure does not fall, it could cause the pulses read by the turbine to be few. When the tool is unclamping, Does the clamp have air pressure (lift piston)?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, it has air pressure.",
					"Camino":"4.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"No, there is no pressure.",
					"Camino":"5.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"4.1",
			"Texto":"4.1. In order to unclamp the tool the PLC program deactivate the solenoid of the air. If even so, there is air pressure to the piston, will mean that the relay or solenoid that it is activated is failing. Check these items. Does the alarm dissapear?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, it disappears.",
					"Camino":"",
					"Mensaje":"Yes, the problem is fixed actuating in the air circuit."
				},
				{
					"Id":"B",
					"Texto":"No, it does not disappear",
					"Camino":"5.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"5.0",
			"Texto":"5. Since this alarm indicates that the piston has not made the full travel, it is possible that there is some oil leakage in the unclamping circuit. Is there any oil leaking problem from the piston or in the adjacent elements (hoses, fittings...) Problem of oil leakage of unclamping piston or in the adjacents elements (hoses, fittings)?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, it looks there is a oil leaking somewhere.",
					"Camino":"5.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"No, it llosk there is not any oil leaking.",
					"Camino":"6.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"5.1",
			"Texto":"5.1. Tight the fittings and try again. Does the leak disappear?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, the leakeage dissapears.",
					"Camino":"",
					"Mensaje":"Yes, the problem was solved just tighting some fittings."
				},
				{
					"Id":"B",
					"Texto":"No,It stil exist an oil leaking.",
					"Camino":"",
					"Mensaje":"Change the necessary items to close the oil leaking."
				}			
			]
		},
		{
			"Id":"6.0",
			"Texto":"6. The pulses read during a tool unclamp operation are seen in the DM810. These pulses are compared with certain constants to know in what position the piston is. For alarm 821 the limit is set in DM112, if the pulses read are lower, but higher than the DM104, the alarm will appear. Are the pulses read in DM810 less than 40?",
			"Imágenes":[
				"a821q6"
			],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes",
					"Camino":"6.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"No, the value is higher than 40.",
					"Camino":"",
					"Mensaje":"Check the value of DM112, it has to have a value of 40. Yes, the value of DM0112 was not properly loaded."
				}			
			]
		},
		{
			"Id":"6.1",
			"Texto":"6.1. While the tool is unclamping, does the light, in the KEYENCE, E004 flashes?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, it flashes.",
					"Camino":"",
					"Mensaje":"If the input flashes, it indicates that the KEYENCE module is counting pulses correctly, but not the right ones. It is possible that the KEYENCE module is defective. It is necessary, at least, to try with a new module."
				},
				{
					"Id":"B",
					"Texto":"No, it does not flash.",
					"Camino":"",
					"Mensaje":"If the tool unlclamps right, but the input light does not blink, it indicates that the turbine is not sending pulses to the KEYENCE. We would have to try another new turbine, and if even with this, the light stil doesn't flash, we would have to change the KEYENCE."
				}			
			]
		}
	],
	"Imágenes":[
		"a821"
	]
}