{
	"Número": 631,
	"Título":"ORDEN DE GIRO MANDRINO SIN HTA.",
	"Descripción":"Se ha ordenado un giro de mandrino sin tener herramienta en el mandrino o estando la hta. desbloqueada",
	"Preguntas":[
		{
			"Id":"1.0",
			"Texto":"1. ¿Se ha activado la alarma 631 sin que haya una herramienta en el mandrino?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Si, no hay ninguna herramienta en el mandrino.",
					"Camino":"1.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"No, sí  hay una herramienta en el mandrino",
					"Camino":"2.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"1.1",
			"Texto":"1.1. Meter una herramienta cualquiera en el mandrino, a mano, y volver a programar un giro de mandrino. ¿Desaparece la alarma?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Si, desaparece.",
					"Camino":"",
					"Mensaje":"Si. El problema era que no tenía una herramienta en el mandrino."
				},
				{
					"Id":"B",
					"Texto":"No, no desaparece",
					"Camino":"2.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"2.0",
			"Texto":"2. Independientemente de la herramiente que tenga el mandrino, ¿siempre sale la alarma?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"No, solo con algunas herramientas.",
					"Camino":"2.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"Si, con todas las herramientas.",
					"Camino":"3.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"2.1",
			"Texto":"2.1. Si el cono está muy desgastado o el tirante de la herrameinta flojo, podrían ocasionar este problema. Comprobar ambas cosas. ¿Desaparece la alarma?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Si, desaparece.",
					"Camino":"",
					"Mensaje":"Si. El problema estaba en el cono o en el tirante de la herramienta."
				},
				{
					"Id":"B",
					"Texto":"No, no desaparece.",
					"Camino":"3.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"3.0",
			"Texto":"3. ¿Es correcta la medida/expulsión de la pinza?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"No, no es correcta.",
					"Camino":"3.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"Si, es correcta.",
					"Camino":"4.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"3.1",
			"Texto":"3.1. Comprobar el tornillo de bloqueo de la pinza y la posición de la pinza del amarrador y, si es necesario, ajustarlo. ¿Desaparece la alarma?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Si, desaparece.",
					"Camino":"",
					"Mensaje":"Si. La pinza del amarrador no estaba bien ajustada."
				},
				{
					"Id":"B",
					"Texto":"No, no desaparece.",
					"Camino":"4.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"4.0",
			"Texto":"4. La unidad KEYENCE, es la que se encarga de comprobar los pulsos de las turbinas para determinar el estado de la herramienta. ¿Qué color tiene la pantalla del KEYENCE? ¿Rojo ó Verde?",
			"Imágenes":[
				"keyence_red",
				"keyence_green"
			],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Roja.",
					"Camino":"4.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"Verde.",
					"Camino":"5.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"4.1",
			"Texto":"4.1. El módulo KEYENCE está parado. Es necesario ponerlo en modo RUN para que lea los pulsos generados por las turbinas. Esto se puede hacer mediante el programa 'Ladder Builder' o usando los propios botones en el frontal del mismo. ¿Desaparece la alarma?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Si, desaparece.",
					"Camino":"",
					"Mensaje":"Si. El módulo KEYENCE estaba parado."
				},
				{
					"Id":"B",
					"Texto":"No, no desaparece.",
					"Camino":"5.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"5.0",
			"Texto":"5. Los pulsos leídos durante una operación de bloqueo/desbloqueo de herramienta se ven en el DM810. Estos pulsos se comparan con ciertas constantes para saber en qué posición se encuentra el pistón. Para la alarma 631 el límite viene fijado en el DM111, si los pulsos leidos son superiores aparecerá la alarma. ¿Los pulsos de la turbina son excesivamente superiores al DM111 siempre o algunas veces?",
			"Imágenes":[
				"a631q5"
			],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"No, solo un poco (1 - 9 pulsos).",
					"Camino":"5.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"Si, son excesivos (+10).",
					"Camino":"6.0",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"5.1",
			"Texto":"5.1. Si por cualquier causa entra aire en el circuito de desbloqueo, los pulsos leidos por la turbina serán excesivos (el aire mueve la turbina). Normalmente purgando este aire se corrige el problema. Purgar el aire del circuito del amarre de herramienta. ¿Desaparece la alarma?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Si, desaparece.",
					"Camino":"",
					"Mensaje":"A pesar de solucionarse el problema purgando el circuito, hay que ver, al cabo de unos dias, si vuelve a aparecer la alarma. Si volviera a aparecer habría que ver por donde entra aire al circuito. Normalmente es del amarrador, aunque habría que comprobar los latiguillos por si hay alguno flojo. En observación: Fuga en amarrador, fallo esporádico..."
				},
				{
					"Id":"B",
					"Texto":"No, no desaparece.",
					"Camino":"",
					"Mensaje":"Al ser la diferencia de pulsos tan pequeña, podemos aumentar el valor del DM111 para corregir el problema, aunque habría que comprobar, en dias sucesivos, si estos pulsos leídos vuelven a aumentar. Si volviese a ocurrir, habría que comprobar los latiguillos, por si hay alguna fuga. Aumentar el valor del DM111 (en observación)."
				}			
			]
		},
		{
			"Id":"6.0",
			"Texto":"6. Si se ha llegado hasta aquí, es porque hay alguna fuga importante de aceite en el circuito. ¿Problema de fuga de aceite del piston del sistema amarre o de algún latiguillo flojo?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Si, hay fuga",
					"Camino":"6.1",
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"No hay fuga.",
					"Camino":"6.2",
					"Mensaje":""
				}			
			]
		},
		{
			"Id":"6.1",
			"Texto":"6.1. Apretar latiguillos y uniones de latiguillos con elementos. ¿Desaparece la alarma?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Si, desaparece la fuga",
					"Camino":"",
					"Mensaje":"Problema resuelto: [latiguillos sueltos]"
				},
				{
					"Id":"B",
					"Texto":"No, no desaparece.",
					"Camino":"",
					"Mensaje":"Si, apretando los latiguillos no se soluciona el problema, lo más plausible es que el amarrador pierda aceite. ¿Cambiar amarrador?"
				}			
			]
		},
		{
			"Id":"6.2",
			"Texto":"6.2. Comprobar recorrido piston amarre.",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Si, correcto.",
					"Camino":"",
					"Mensaje":"Si nos hay fugas, tenemos que suponer que el circuito hydráulico está bien, por lo tanto está fallando la lectura del propio KEYENCE. Comprobar que durante el bloquéo de la herrameinta la entrada E004 del KEYENCE parpadea, si parpadea cambiar el módulo KEYENCE, si sí que parpadea, cambiar la turbina E15-B15."
				},
				{
					"Id":"B",
					"Texto":"No, no es correcto.. ",
					"Camino":"",
					"Mensaje":"Si el recorrido del pistón no es correcto, sería necesario cambiar todo el amarrador, cambiando las bellevilles."
				}			
			]
		}

	],
	"Imágenes":[
		"a631"
	]
}