{
	"Número": 631,
	"Título":"SPINDLE ROTATION ORDER WITHOUT TOOL.",
	"Descripción":"It has been given an spindle rotation whit the head without any tool or been the tool unclamped.",
	"Preguntas":[
		{
			"Id":1.0,
			"Texto":"1. Did the alarm 631 appear with no tool inside the spindle?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, there is no tool in the spindle.",
					"Camino":1.1,
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"No, there is a tool in the spindle.",
					"Camino":2.0,
					"Mensaje":""
				}			
			]
		},
		{
			"Id":1.1,
			"Texto":"1.1. Place a tool, manually, in the spindle and try to program an spindle rotation again. Does the alarm 631 appears again?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Not, it doesn't appear any more.",
					"Camino":-1.0,
					"Mensaje":"Yes. The problem happend bececause there was no tool in the spindle."
				},
				{
					"Id":"B",
					"Texto":"Yes, it appears again.",
					"Camino":2.0,
					"Mensaje":""
				}			
			]
		},
		{
			"Id":2.0,
			"Texto":"2. Regardless of the tool that has the spndle, does the alarm always come out?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"No, just with some specific tools..",
					"Camino":2.1,
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"Yes, it happends with any tool.",
					"Camino":3.0,
					"Mensaje":""
				}			
			]
		},
		{
			"Id":2.1,
			"Texto":"2.1. If the cone is very worn or the pull-stad of the tool loosen, this could cause this problem. Check both things. Does the alarm disappear?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, the alarm doesn't appear again.",
					"Camino":-1.0,
					"Mensaje":"Yes, the problem was related to the cone of the tool or the tool pull-stud."
				},
				{
					"Id":"B",
					"Texto":"No, it happened again.",
					"Camino":3.0,
					"Mensaje":""
				}			
			]
		},
		{
			"Id":3.0,
			"Texto":"3. Is the measurement / expulsion of the clamp correct?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"No, it is not correct.",
					"Camino":3.1,
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"Yes, it is right.",
					"Camino":4.0,
					"Mensaje":""
				}			
			]
		},
		{
			"Id":3.1,
			"Texto":"3.1. Check that the centre lock screw is tight, if not, adjust the unclamping distance (rotating the gripper) and tight the screw. Does the alarm disappear?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, the alarm doesn't appear again.",
					"Camino":-1.0,
					"Mensaje":"Yes, the tool gripper was not properly adjusted."
				},
				{
					"Id":"B",
					"Texto":"No, it happened again.",
					"Camino":4.0,
					"Mensaje":""
				}			
			]
		},
		{
			"Id":4.0,
			"Texto":"4.The KEYENCE unit, is the one in charge of checking the pulses of the turbines to determine the status of the tool. What color does the KEYENCE screen have? Red or green?",
			"Imágenes":[
				"a631q4a",
				"a631q4b"
			],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Red.",
					"Camino":4.1,
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"Green.",
					"Camino":5.0,
					"Mensaje":""
				}			
			]
		},
		{
			"Id":4.1,
			"Texto":"4.1. The KEYENCE module is stopped. It is necessary to put it in RUN mode to read the pulses generated by the turbines. This can be done through the 'Ladder Builder' program or using the buttons on the front of it. Does the alarm disappear?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, the alarm doesn't appear again.",
					"Camino":-1.0,
					"Mensaje":"Yes. The KEYENCE module was in STOP mode."
				},
				{
					"Id":"B",
					"Texto":"No, it happened again. ",
					"Camino":5.0,
					"Mensaje":""
				}			
			]
		},
		{
			"Id":5.0,
			"Texto":"5. The pulses read during a tool clamp / unclamp operation can be read in the DM810. These pulses are compared with certain constants to know in what position the piston is. For alarm 631 the limit is set in DM111, if the read pulses are higher the alarm will appear. Are the pulses of the turbine exceedingly higher than the DM111 always or sometimes?",
			"Imágenes":[
				"a631q5"
			],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"No, just a few (1 - 9 pulses).",
					"Camino":5.1,
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"Yes, they are excesive (+10).",
					"Camino":6.0,
					"Mensaje":""
				}			
			]
		},
		{
			"Id":5.1,
			"Texto":"5.1. If for any reason, air enters the tool clamping circuit, the pulses read by the turbine will be excessive (the air moves the turbine). Usually purging this air corrects the problem. Bleed the air from the tool clamping circuit. Does the alarm disappear?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, the alarm doesn't appear again.",
					"Camino":-1.0,
					"Mensaje":"In spite of solving the problem by purging the circuit, it is necessary to see, after few days, if the alarm reappears. If it reappeared, it would be necessary to see where the air enters the circuit. Usually it is from the tool clamping piston, although the hoses should be checked in case there is any leaking. In observation: tool clamping piston leaking, sporadic failure ..."
				},
				{
					"Id":"B",
					"Texto":"No, it doesn't disappear.",
					"Camino":-1.0,
					"Mensaje":"As the pulse difference is so small, we can increase the value of DM111 to correct the problem, although it would be necessary to check, in successive days, if these read pulses increase again. If it  happen again, you should check the hoses, in case there is a oil leak. Increase the value of DM111 (under observation)."
				}			
			]
		},
		{
			"Id":6.0,
			"Texto":"6. If you have come this far, it is because there is a significant oil leak in the circuit. Problem of oil leakage from the tool calmping piston or from a hose loose ?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, there are oil leaks.",
					"Camino":6.1,
					"Mensaje":""
				},
				{
					"Id":"B",
					"Texto":"No, there are not oil leaks.",
					"Camino":6.2,
					"Mensaje":""
				}			
			]
		},
		{
			"Id":6.1,
			"Texto":"6.1. Tighten hoses and connections between elements. Does the alarm disappear?",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, the leak desappears.",
					"Camino":-1.0,
					"Mensaje":"Yes, hoses loosen and tighted."
				},
				{
					"Id":"B",
					"Texto":"No, it doesn't desappears.",
					"Camino":-1.0,
					"Mensaje":"If, tightening the hoses does not solve the problem, the most plausible thing is that the tool clamping system loses oil. Change the tool clamping piston set?"
				}			
			]
		},
		{
			"Id":6.2,
			"Texto":"6.2. Check tool piston deplacement.",
			"Imágenes":[],
			"Respuestas":[
				{
					"Id":"A",
					"Texto":"Yes, it is right.",
					"Camino":-1.0,
					"Mensaje":"If there are no leaks, we have to assume that the hydraulic circuit is fine, therefore the reading of KEYENCE itself is failing. Check that while the tool is clamping the input E004 of the KEYENCE flashes, if it flashes change the KEYENCE module, if it does flash, change the turbine E15-B15."
				},
				{
					"Id":"B",
					"Texto":"No, it is not right...",
					"Camino":-1.0,
					"Mensaje":"If the stroke of the piston is not right, it would be necessary to change the whole tool clamping piston, changing the bellevilles washers."
				}			
			]
		}

	],
	"Imágenes":[
		"a631"
	]
}